In [12]:
import pandas as pd
import sqlalchemy as sql

engine = sql.create_engine("mysql://hocvien:CodeGym@14.225.44.220:3306/classicmodels?charset=utf8mb4")
connection = engine.connect()

In [13]:
vd = pd.read_sql_query("select CustomerName, City FROM customers", connection)
vd

                       CustomerName          City
0                 Atelier graphique        Nantes
1                Signal Gift Stores     Las Vegas
2        Australian Collectors, Co.     Melbourne
3                 La Rochelle Gifts        Nantes
4                Baane Mini Imports       Stavern
..                              ...           ...
117    Motor Mint Distributors Inc.  Philadelphia
118        Signal Collectibles Ltd.      Brisbane
119  Double Decker Gift Stores, Ltd        London
120            Diecast Collectables        Boston
121               Kelly's Gift Shop    Auckland

[122 rows x 2 columns]

In [22]:
vd1 = pd.read_sql_query("select * FROM customers where Country = 'USA'limit 1", connection)
vd1

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,None,Las Vegas,NV,83030,USA,1166,71800.0

In [16]:
vd3 = pd.read_sql_query("select customerName FROM customers where city LIKE 'N_'", connection)
vd3

Empty DataFrame
Columns: [customerName]
Index: []

In [6]:
query = 'SELECT customerName, country, city, creditLimit FROM customers WHERE country = "UK" \
ORDER BY creditLimit deSC LIMIT 1'
vd9 = pd.read_sql_query(query,connection)
vd9

     customerName country        city  creditLimit
0  AV Stores, Co.      UK  Manchester     136800.0

In [17]:
query = "SELECT DISTINCT city FROM customers WHERE country = 'Russia'"
vd11 = pd.read_sql_query(query,connection)
vd11

               city
0  Saint Petersburg

In [25]:
query = "SELECT  count(customerNumber) FROM customers WHERE country = 'USA'"
vd13 = pd.read_sql_query(query,connection)
vd13

   count(customerNumber)
0                     36